Autodesk.Navisworks.Api.Plugins.FileProtocolPluginRecord
Represents a FileProtocolPlugin record in Navisworks

Autodesk.Navisworks.Api.Plugins.FileProtocolPluginRecord.LoadedPlugin
Gets the plugin if loaded, otherwise null

Autodesk.Navisworks.Api.Plugins.FileProtocolPluginRecord.LoadPlugin
Returns the plugin, loads it if required
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException: Plugin failed to load

Autodesk.Navisworks.Api.Plugins.FileProtocolPluginRecord.TryLoadPlugin
Returns the plugin, loads it if required
Returns:
null if plugin failed to load